# Q.1.

# Some common functions in pandas :


head()

tail()

describe()

info()

len()

In [1]:
import pandas as pd

df = pd.read_csv('iris.csv')

In [2]:
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [3]:
df.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [4]:
df.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [6]:
len(df)

150

# Q.2.

In [7]:
data1 = pd.DataFrame({'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]})

In [8]:
data1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [9]:
df_reindexed = data1.reindex(index=[1,3,5], columns=['A', 'B', 'C'])

In [10]:
df_reindexed

     A    B    C
1  2.0  5.0  8.0
3  NaN  NaN  NaN
5  NaN  NaN  NaN

# Q.3.

In [ ]:
sum = df['Values'].iloc[0:2].sum()
sum

# Q.4.

In [35]:
def wordcount(x):
    return len(x.split(' '))

In [ ]:
df['Word_Count'] = df['Text'].apply(wordcount)

# Q.5.

# dataframe.size

Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

# dataframe.shape
Return : Returns tuple of shape (Rows, columns) of dataframe/series

In [38]:
#for eg.
print(df.size)
print(df.shape)

750
(150, 5)

# Q.6.

pd.read_excel()

# Q.7.

In [39]:
def uname(x):
    return x.split('@')[0]

In [ ]:
df['Username'] = df['Email'].apply(uname)

# Q.8.

In [ ]:
df[(df['A'] > 5) & (df['B'] < 10)]

# Q.9.

In [ ]:
df['Values'].mean()

In [ ]:
df['Values'].median()

In [ ]:
df['Values'].std()

# Q.10.

In [ ]:
df['MovingAverage'] = df['Sales'].rolling(window=7).mean()

# Q.11

In [ ]:
df['Weekday'] = df['Date'].dt.day_name()

# Q.12.

In [ ]:
newdf = df[(df['Date'] > '2023-01-01') & (df['Date'] < '2023-01-31')]

# Q.13.

the first and foremost necessary library that needs to be imported is Pandas